= 少しづつでも毎日続けてみる

//flushright{
yumechi
//}

ここ最近は公私ともに自分の時間が取りにくくなってきた yumechi です。
私はソフトウェアエンジニアとして働いています。
業務ではコードを書く仕事以外にも、チームをリードする立場としての仕事も増えてきています。
またプライベートでは、東京以外の地域のコミュニティにも興味があり、様々な地方にも足を運んでいるため時間が取れないことが多いです。

しかしソフトウェアエンジニアとしての仕事を続けていくためには、日々新しい技術や知識を取り入れていくことが大切だと考えています。
最近では AI やクラウドサービスの発展が非常に早く、数年前の情報や常識が通用しないことも多く、働き続けるためにも学び続けることが大切だと感じています。
今回は時間がない中でも自分が実践していることを紹介します。

== 移動時間を活用する

私は関東近辺に住んでいることもあり、電車での移動が多いです。
ただしいわゆるカンファレンスや勉強会が開催される会場からは少し離れているので、30分〜1時間程度の移動時間がかかります。
通勤に関しても同様です。

私はこの時間によく Kindle@<fn>{kindle} の電子書籍サービスで本を読んでいます。
Kindle には多くの技術書、ビジネス書などがあり、自分の興味に合わせて読むことができます。
私が移動中に心がけていることは次の点です。

 * なるべく行きの電車で読む（帰りは疲れていることが多いので頭に入らないため）
 * タブレットなど大きなディスプレイで読む（スマートフォンだと画面が小さく目が疲れやすいため）
 * 本を読むときは単語、キーワードレベルでメモを取る（Discordにメモを取るチャンネルを作っている）
 ** 最近は ChatGPT@<fn>{chatgpt} に質問をしておいて要約とメモを兼ねて投稿することも多いです
 * 移動中はビジネス書や雑学を中心に読む（技術書は集中力が必要でかつ書籍レイアウトが固定となっていることが多いため。特にソースコードが読みずらいです）

特にタブレットで電子書籍を読むことはおすすめです。
ディスプレイサイズが大きく目が疲れにくいこと、またディスプレイサイズが大きいために一度に表示される文字数が多く、スクロールが少なくて済むためです。
私は Lenovo社のLenovo Tab M8@<fn>{lenovo} を使っていますが、価格も2万円以内のため手頃でおすすめです。

しかし時間帯や曜日によっては電車が混んでいるときもあります。
その場合は Audible@<fn>{audible} で適当な本を再生して聴いています。
Audible は月額プランに入ることで多くの本が聴き放題になり、音声で本の内容を理解できるため、読書や活字が苦手な人にもおすすめです。

ちなみに私は帰りの電車では SNS やソーシャルゲームをやっています。
大体帰るタイミングでは疲れていることが多いので、無理に学ぼうとするよりもリラックスして過ごすことを優先しています。

//footnote[kindle][Amazon社が展開している電子書籍サービス https://www.amazon.co.jp/kindle-dbs/storefront]
//footnote[chatgpt][OpenAI社が提供している自然言語処理モデル及びチャットサービス https://openai.com/gpt/]
//footnote[lenovo][Lenovo社が提供しているタブレット端末 https://www.lenovo.com/jp/ja/p/tablets/android-tablets/tablets-m-series/lenovo-tab-m8-gen-4-8-inch-mtk/len103l0013]
//footnote[audible][Amazon社が提供しているオーディオブックサービス https://www.audible.co.jp/]

== 注文の待ち時間を利用する

私はリモートワークで働いていますが、お昼休みは散歩も兼ねて外で食事をすることが多いです。
飲食店では、注文をしてから料理が出てくるまでの待ち時間があります。
その間に私は英語のスマートフォンアプリなどをやっています。

利用しているアプリとしてはDuolingo@<fn>{duolingo} や モノグサ@<fn>{monoxer} などがあり、アプリを使って英単語や英語表現を学んでいます。
個人的に英単語は見聞きする回数を増やしていくことで、自然と覚えられるようになると感じているため、少しでも見聞きする量を増やすためアプリを利用しています。
意外と中学生レベルの単語を忘れていることも多いので、復習も兼ねています（英語学習に対しては当時時間をかけていれば…という後悔もあります）。

またなぜスマートフォンアプリなのか？というと、お昼ご飯を食べるときにはスマートフォンと鍵くらいしか持ち歩かず、余計なものを持ち歩きたくないためです。
また英単語であれば短時間でできることが多いため、待ち時間にちょうどよいと感じています。
他にもこの待ち時間で Qiita@<fn>{qiita} や Zenn@<fn>{zenn} を見る時間にもしており、トレンドから面白そうな技術記事を流し読みしています。

//footnote[duolingo][DuoLingo社が提供している言語学習アプリ。私は英語のコースをやっています。 https://www.duolingo.com/]
//footnote[monoxer][Monoxer社が提供している学習用アプリ。学生でなくても一部の英単語帳が無料なので活用しています。 https://monoxer.com/]
//footnote[qiita][Qiita株式会社が運営している技術系の情報共有サービス https://qiita.com/]
//footnote[zenn][クラスメソッド社が運営している技術系の情報共有サービス https://zenn.dev/]

== ブログを書く

最近はあまりブログを書けていませんが、なるべくイベントに参加したときはブログを書くようにしています。
自分の学んだことを自分の言葉で文章にすることで、自分の理解度を深め記憶にも定着しやすくなります。
またその時の気づき、感想、感情を文章にすることで、自分の成長をふりかえることもできます。

ブログを書く際に1つ気づいたテクニックがあります。
そのテクニックとは覚えている3つのことをキーワードにしてブログを書くことです。
最近は自分が覚えられるのはせいぜい1トークで3つくらいだと気づいたためです。
キーワードにしてブログを書くことでブログを書くハードルを下げ、続けやすくなると感じています。

そしてキーワードを絞ることでブログを書く時間も大幅に短縮できるため、続けやすくなると感じています。
具体的にはオフライン開催の場合、だいたい帰りの電車で書ききれてしまうくらいの時間で書けるようになりました。
書くのが大変という方は小さく自分が学んだことをアウトプットとして書いてみることをおすすめします。

ちなみに以前までは学んだことを最大化しようとして長い文章を書こうとしていました。
文章が長くなればなるほど書く時間が伸びるため、結局ブログ記事出せないままになってしまうことが多かったです。
ブログ記事を出せないということはフィードバックを受ける機会が減り、また自分自身にとっても重要な点がぶれやすくアウトプットとしても質が下がりがちだと感じています。
そのため短くてもいいので書いて公開するという方針に変えました。

私の中でブログを書く際に意識しているポイントとして、わからなかったことを記録しておくことがあります。
特に良い発表というのは学ぶべきポイントが多いのですが、自分自身の知識や経験の不足によりブログを書く時点ではわからないことも多いです。
しかし後から見返してみてわかるという経験が何度もありました。
見返すことで自分の成長を実感できることも多いので、わからないことも記録しておくことが大事だと感じています。

== いろいろな実践を通して

移動時間や待ち時間を活用して、少しずつでも毎日続けてみることが大事だと感じています。
スキマ時間も学びに当てていて、少し窮屈な部分があるとは思いますが、それでも学び続けることは大事です。
自分の仕事やプライベートも疎かにしないようバランスを取りながら、学び続けるということも大事です。

学び続けるために大事なこととしては、行動の目的を持つことです。
私が英単語を勉強しているのは、海外旅行に挑戦したいという気持ちがあり、そのための準備として進めています。
時間があるときは英語でのライティングやスピーキングも練習していますが、いつもその時間が取れるとは限りません。
少しでも時間があるときに学び続けることで、少しでも理解できるよう努力しています。
また自分自身が何をしたいのか、どうなりたいのかを考えることも重要だと感じているのでお風呂の時間に考えてみるのも良いかもしれません。

他には習慣化していくことも大事です。
私自身も環境の変化によってまさかこんなに時間が取れなくなるとはと思っており、いつまでものんびりしている時間がないことを実感しています。
私の周りを見ると育児や介護などで時間を取ることができない人も多い状況ですが、少しでも時間を取って続けられるよう習慣化していくことが大事です。
習慣化さえしてしまえば、その時間を取ることが当たり前になるため、続けやすくなります。
私も以前まではのんびりと SNS を見て、自分に関係がないことに一喜一憂などしていましたが、今はそういった時間を使わないようにし、自分と向き合って学びに当てるようにしています。

最後になりましたが、勉強や学びを続ける腰が重い皆さんに良い動画があります。そちらを紹介させてください。
その動画とは YouTube の「桜井政博のゲーム作るには」チャンネルの、「とにかくやれ!! 【仕事の姿勢】」@<fn>{sakurai} です。
私は朝起きてから活動するまでに時間がかかってしまうことがあり、毎朝この動画を見て勇気付けられてから活動を始めています。
自分が理想とすることを実現するために、今日からでも行動を起こしていきましょう！

//footnote[sakurai][桜井政博のゲーム作るには - とにかくやれ!! 【仕事の姿勢】 https://www.youtube.com/watch?v=JV3KOJ_Z4Vs]
