= 少しづつでも毎日続けてみる

//flushright{
yumechi
//}

ここ最近は公私ともに自分の時間が取りにくくなってきた yumechi です。
業務ではコードを書くエンジニアとしての仕事以外にも、チームをリードする立場としての仕事も増えてきています。
またプライベートでは、東京以外の地域のコミュニティにも興味があり、そちらにも参加しているため時間が取りにくくなってきています。

しかしソフトウェアエンジニアとしての仕事を続けていくためには、日々新しい技術や知識を取り入れていくことが大切だと考えています。
今回は時間がない中でも自分が実践していることを紹介します。

== 移動時間を活用する

私は関東近辺に住んでいることもあり、電車での移動が多いです。
ただしいわゆるカンファレンスや勉強会が開催されがちな場所からは少し離れているので、30分〜1時間程度の移動時間がかかります。
通勤に関しても同様です。

私はこの時間によく Kindle書籍@<fn>{kindle} で本を読んでいます。
Kindle には多くの技術書、ビジネス書などがあり、自分の興味に合わせて読むことができます。
私が移動中に心がけていることは次の点です。

 * なるべく行きの電車で読む（帰りは疲れていることが多いので頭に入らないため）
 * タブレットなどで読む（スマホだと画面が小さく目が疲れやすいため）
 * 本を読むときは単語、キーワードレベルでメモを取る（Discordとかにメモを取るチャンネルを作っている）
 ** 最近は ChatGPT@<fn>{chatgpt} に質問をしておいて要約とメモを兼ねてもらっています
 * 移動中はビジネス書や雑学を中心に読む（技術書は集中力が必要でかつコードレイアウトが読みづらく理解しづらいケースがあるため）

特にタブレットで読むのはおすすめです。
ディスプレイサイズが大きく目が疲れにくいこと、またディスプレイサイズが大きいために一度に表示される文字数が多く、スクロールが少なくて済むためです。
私は Lenovo社のLenovo Tab M8@<fn>{lenovo} を使っていますが、価格も2万円以内のため手頃でおすすめです。

ただし電車が混んでいるときもあります。
その場合は Audible@<fn>{audible} で適当な本を流しています。
Audible は月額プランに入ることで多くの本が聴き放題になるため、本を読むのが苦手な人にもおすすめです。

ちなみに私は帰りの電車では SNS やソーシャルゲームをやっています。
大体帰るタイミングでは疲れていることが多いので、無理に学ぼうとするよりもリラックスして過ごすことが大切だと考えています。

//footnote[kindle][Amazon社が展開している電子書籍サービス https://www.amazon.co.jp/kindle-dbs/storefront]
//footnote[chatgpt][OpenAI社が提供している自然言語処理モデル及びチャットサービス https://openai.com/gpt/]
//footnote[lenovo][Lenovo社が提供しているタブレット端末 https://www.lenovo.com/jp/ja/p/tablets/android-tablets/tablets-m-series/lenovo-tab-m8-gen-4-8-inch-mtk/len103l0013]
//footnote[audible][Amazon社が提供しているオーディオブックサービス https://www.audible.co.jp/]

== 注文の待ち時間を利用する

私はリモートワークで働いていますが、お昼休みは散歩も兼ねて外で食事をすることが多いです。
その際に注文をしてから料理が出てくるまでの待ち時間もあるので、その間には英単語アプリなどをやっています。

Duolingo@<fn>{duolingo} や モノグサ@<fn>{monoxer} などのアプリを使って、英単語を学んでいます。
個人的に英単語は見聞きする回数を増やしていくことで、自然と覚えられるようになると感じているため、このようなアプリを利用しています。
意外と中学生レベルの単語を忘れていることも多いので、復習も兼ねています（英語学習に対して当時時間をかけていれば…という後悔もあります）。

またなぜ英単語アプリなのか？というと、お昼ご飯を食べるときにはスマホと鍵くらいしか持ち歩かないので、荷物が少ない状態でもできるからです。
また英単語アプリは短時間でできることが多いため、待ち時間にちょうどよいと感じています。
他にもこの待ち時間で Qiita@<fn>{qiita} や Zenn@<fn>{zenn} を見る時間にもしており、トレンドから面白そうな記事を流し読みしています。

//footnote[duolingo][DuoLingo社が提供している言語学習アプリ。私は英語のコースをやっています。 https://www.duolingo.com/]
//footnote[monoxer][Monoxer社が提供している学習用アプリ。学生でなくても一部の英単語帳が無料なので活用しています。 https://monoxer.com/]
//footnote[qiita][Qiita株式会社が運営している技術系の情報共有サービス https://qiita.com/]
//footnote[zenn][クラスメソッド社が運営している技術系の情報共有サービス https://zenn.dev/]

== ブログを書く

最近はあまり書けていませんが、なるべくイベントがあったときにはブログを書くようにしています。

ちなみにブログを書くためのハードルを下げる方法として最近気づいたことがあります。
以前までは学んだことを最大化しようとして長い文章を書こうとしていました。
そうするといつまでもブログを書くことができず、結局出せないままになってしまうことが多かったです。
最近は自分が覚えられるのはせいぜい1トークで3つくらいだと気づきました。
覚えている3つのことをキーワードにしてブログを書くようにしています。
この方法にすることでブログを書くためのハードルを下げ、続けやすくなりました（とはいえ時間の都合で書けていないことも多いのですが…）。

そしてキーワードを絞ることでブログを書く時間も大幅に短縮できるため、続けやすくなると感じています。
具体的にはオフライン開催の場合、だいたい帰りの電車で書ききれてしまうくらいの時間で書けるようになりました。
書くのが大変という方は小さく自分が学んだことをアウトプットとして書いてみることをおすすめします。

また自分の学んだことを自分の言葉で文章にすることで、自分の理解度を深まり記憶にも定着しやすくなります。
私の中で意識しているポイントではその段階でわからなかったことでも、わからなかったことを記録しておくことだと考えています。
特に良い発表というのは学ぶべきポイントが多いので、その時点ではわからないことも多いです。
しかし後から見返してみてわかるという経験が何度もありました。
ですので、わからないことの記録も大事だと考えています。

== まとめ

移動時間や待ち時間を活用して、少しずつでも毎日続けてみることが大切だと感じています。
自分の時間が取りにくくなっている中で、自分の仕事やプライベートも大事にしつつ学び続けることが大切だと考えています。
スキマ時間も学びに当てていて、少し窮屈な部分があるとは思いますが、それでも続けることが大切だと感じています。

学び続けるために大切なこととしては、行動の目的を持つことが大切だと感じています。
私が英単語を勉強しているのは、海外旅行に挑戦したいという気持ちがあり、そのための準備として進めています。
時間があるときはなるべくライティングやスピーキングも練習していますが、いつもその時間が取れるとは限りません。
少しでも時間があるときに学び続けることで、少しでも理解できるよう努力しています。

他には習慣化していくことが大事だと考えています。
私も環境の変化によってまさかこんなに時間が取れなくなるとはと思っており、いつまでもダラダラとしている時間がないことを実感しています。
育児や介護などで時間を取ることができない人も多いと思いますが、少しでも時間を取れるように習慣化していくことが大事です。
習慣化さえしてしまえば、その時間を取ることが当たり前になるため、続けやすくなります。
私も以前まではダラダラと SNS を見て、自分に関係がないことに一喜一憂などしていましたが、今はそういった時間を使わないようにし、自分と向き合って学びに当てるようにしています。

最後になりましたが、勉強や学びを続ける腰が重い皆さんに良い動画があります。そちらを紹介して終わりとさせていただきます。
その動画とは YouTube の「桜井政博のゲーム作るには」チャンネルの、「とにかくやれ!! 【仕事の姿勢】」@<fn>{sakurai} です。
私は朝起きてから活動するまでに時間がかかってしまうことがあり、毎朝この動画を見て勇気づけられてから活動しています。
とにかく今日からやっていきましょう！

//footnote[sakurai][桜井政博のゲーム作るには - とにかくやれ!! 【仕事の姿勢】 https://www.youtube.com/watch?v=JV3KOJ_Z4Vs]
